cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51J.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="ADC0">
      <name>ADC1</name>
      <description>Analog Digital Converter 1</description>
      <baseAddress>0x43002000</baseAddress>
      <interrupt>
        <name>ADC1_OTHER</name>
        <value>120</value>
      </interrupt>
      <interrupt>
        <name>ADC1_RESRDY</name>
        <value>121</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <version>2.2.0</version>
      <description>Advanced Encryption Standard</description>
      <groupName>AES</groupName>
      <prependToName>AES_</prependToName>
      <baseAddress>0x42002400</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AES</name>
        <value>130</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AESMODE</name>
              <description>AES Modes of operation</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>AESMODESelect</name>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>Electronic code book mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>Cipher block chaining mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFB</name>
                  <description>Output feedback mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFB</name>
                  <description>Cipher feedback mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COUNTER</name>
                  <description>Counter mode</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCM</name>
                  <description>CCM mode</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCM</name>
                  <description>Galois counter mode</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CFBS</name>
              <description>Cipher Feedback Block Size</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CFBSSelect</name>
                <enumeratedValue>
                  <name>128BIT</name>
                  <description>128-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64BIT</name>
                  <description>64-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32BIT</name>
                  <description>32-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16BIT</name>
                  <description>16-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8BIT</name>
                  <description>8-bit Input data block for Encryption/Decryption in Cipher Feedback mode</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYSIZE</name>
              <description>Encryption Key Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>KEYSIZESelect</name>
                <enumeratedValue>
                  <name>128BIT</name>
                  <description>128-bit Key for Encryption / Decryption</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>192BIT</name>
                  <description>192-bit Key for Encryption / Decryption</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256BIT</name>
                  <description>256-bit Key for Encryption / Decryption</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIPHER</name>
              <description>Cipher Mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CIPHERSelect</name>
                <enumeratedValue>
                  <name>DEC</name>
                  <description>Decryption</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENC</name>
                  <description>Encryption</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STARTMODE</name>
              <description>Start Mode Select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>STARTMODESelect</name>
                <enumeratedValue>
                  <name>MANUAL</name>
                  <description>Start Encryption / Decryption in Manual mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO</name>
                  <description>Start Encryption / Decryption in Auto mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOD</name>
              <description>Last Output Data Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>LODSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST</name>
                  <description>Start encryption in Last Output Data mode</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYGEN</name>
              <description>Last Key Generation</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>KEYGENSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LAST</name>
                  <description>Start Computation of the last NK words of the expanded key</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>XORKEY</name>
              <description>XOR Key Operation</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>XORKEYSelect</name>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No effect</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XOR</name>
                  <description>The user keyword gets XORed with the previous keyword register content.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CTYPE</name>
              <description>Counter Measure Type</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRLB</name>
          <description>Control B</description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>START</name>
              <description>Start Encryption/Decryption</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>NEWMSG</name>
              <description>New message</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EOM</name>
              <description>End of message</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFMUL</name>
              <description>GF Multiplication</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x05</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENCCMP</name>
              <description>Encryption Complete Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFMCMP</name>
              <description>GF Multiplication Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x06</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENCCMP</name>
              <description>Encryption Complete Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFMCMP</name>
              <description>GF Multiplication Complete Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status</description>
          <addressOffset>0x07</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>ENCCMP</name>
              <description>Encryption Complete</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>GFMCMP</name>
              <description>GF Multiplication Complete</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DATABUFPTR</name>
          <description>Data buffer pointer</description>
          <addressOffset>0x08</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>INDATAPTR</name>
              <description>Input Data Pointer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCTRL</name>
          <description>Debug control</description>
          <addressOffset>0x09</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>DBGRUN</name>
              <description>Debug Run</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>KEYWORD%s</name>
          <description>Keyword n</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <name>INDATA</name>
          <description>Indata</description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>INTVECTV%s</name>
          <description>Initialisation Vector n</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>write-only</access>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>HASHKEY%s</name>
          <description>Hash key n</description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>GHASH%s</name>
          <description>Galois Hash n</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>CIPLEN</name>
          <description>Cipher Length</description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
        </register>
        <register>
          <name>RANDSEED</name>
          <description>Random Seed</description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
        </register>
