cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51J.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CMCC</name>
      <version>6.0.0</version>
      <description>Cortex M Cache Controller</description>
      <groupName>CMCC</groupName>
      <prependToName>CMCC_</prependToName>
      <baseAddress>0x41006000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>TYPE</name>
          <description>Cache Type Register</description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x000012D2</resetValue>
          <fields>
            <field>
              <name>GCLK</name>
              <description>dynamic Clock Gating supported</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RRP</name>
              <description>Round Robin Policy supported</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WAYNUM</name>
              <description>Number of Way</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>WAYNUMSelect</name>
                <enumeratedValue>
                  <name>DMAPPED</name>
                  <description>Direct Mapped Cache</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARCH2WAY</name>
                  <description>2-WAY set associative</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ARCH4WAY</name>
                  <description>4-WAY set associative</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCKDOWN</name>
              <description>Lock Down supported</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIZE</name>
              <description>Cache Size</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CSIZESelect</name>
                <enumeratedValue>
                  <name>CSIZE_1KB</name>
                  <description>Cache Size is 1 KB</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSIZE_2KB</name>
                  <description>Cache Size is 2 KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSIZE_4KB</name>
                  <description>Cache Size is 4 KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSIZE_8KB</name>
                  <description>Cache Size is 8 KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSIZE_16KB</name>
                  <description>Cache Size is 16 KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSIZE_32KB</name>
                  <description>Cache Size is 32 KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSIZE_64KB</name>
                  <description>Cache Size is 64 KB</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLSIZE</name>
              <description>Cache Line Size</description>
              <bitOffset>11</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CLSIZESelect</name>
                <enumeratedValue>
                  <name>CLSIZE_4B</name>
                  <description>Cache Line Size is 4 bytes</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLSIZE_8B</name>
                  <description>Cache Line Size is 8 bytes</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLSIZE_16B</name>
                  <description>Cache Line Size is 16 bytes</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLSIZE_32B</name>
                  <description>Cache Line Size is 32 bytes</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLSIZE_64B</name>
                  <description>Cache Line Size is 64 bytes</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLSIZE_128B</name>
                  <description>Cache Line Size is 128 bytes</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CFG</name>
          <description>Cache Configuration Register</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <resetValue>0x00000020</resetValue>
          <fields>
            <field>
              <name>ICDIS</name>
              <description>Instruction Cache Disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DCDIS</name>
              <description>Data Cache Disable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CSIZESW</name>
              <description>Cache size configured by software</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>CSIZESWSelect</name>
                <enumeratedValue>
                  <name>CONF_CSIZE_1KB</name>
                  <description>the Cache Size is configured to 1KB</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONF_CSIZE_2KB</name>
                  <description>the Cache Size is configured to 2KB</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONF_CSIZE_4KB</name>
                  <description>the Cache Size is configured to 4KB</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONF_CSIZE_8KB</name>
                  <description>the Cache Size is configured to 8KB</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONF_CSIZE_16KB</name>
                  <description>the Cache Size is configured to 16KB</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONF_CSIZE_32KB</name>
                  <description>the Cache Size is configured to 32KB</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CONF_CSIZE_64KB</name>
                  <description>the Cache Size is configured to 64KB</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <description>Cache Control Register</description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>CEN</name>
              <description>Cache Controller Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>Cache Status Register</description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CSTS</name>
              <description>Cache Controller Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>LCKWAY</name>
          <description>Cache Lock per Way Register</description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>LCKWAY</name>
              <description>Lockdown way Register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAINT0</name>
          <description>Cache Maintenance Register 0</description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>INVALL</name>
              <description>Cache Controller invalidate All</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MAINT1</name>
          <description>Cache Maintenance Register 1</description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>INDEX</name>
              <description>Invalidate Index</description>
              <bitOffset>4</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>WAY</name>
              <description>Invalidate Way</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>WAYSelect</name>
                <enumeratedValue>
                  <name>WAY0</name>
                  <description>Way 0 is selection for index invalidation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAY1</name>
                  <description>Way 1 is selection for index invalidation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAY2</name>
                  <description>Way 2 is selection for index invalidation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WAY3</name>
                  <description>Way 3 is selection for index invalidation</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCFG</name>
          <description>Cache Monitor Configuration Register</description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MODE</name>
              <description>Cache Controller Monitor Counter Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>MODESelect</name>
                <enumeratedValue>
                  <name>CYCLE_COUNT</name>
                  <description>cycle counter</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IHIT_COUNT</name>
                  <description>instruction hit counter</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DHIT_COUNT</name>
                  <description>data hit counter</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MEN</name>
          <description>Cache Monitor Enable Register</description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>MENABLE</name>
              <description>Cache Controller Monitor Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MCTRL</name>
          <description>Cache Monitor Control Register</description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Cache Controller Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>MSR</name>
          <description>Cache Monitor Status Register</description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>EVENT_CNT</name>
              <description>Monitor Event Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
