cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51J.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>I2S</name>
      <version>2.0.0</version>
      <description>Inter-IC Sound Interface</description>
      <groupName>I2S</groupName>
      <prependToName>I2S_</prependToName>
      <baseAddress>0x43002800</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x40</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2S</name>
        <value>128</value>
      </interrupt>
      <registers>
        <register>
          <name>CTRLA</name>
          <description>Control A</description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN0</name>
              <description>Clock Unit 0 Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN1</name>
              <description>Clock Unit 1 Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN</name>
              <description>Tx Serializer Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXEN</name>
              <description>Rx Serializer Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>2</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CLKCTRL%s</name>
          <description>Clock Unit n Control</description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>SLOTSIZE</name>
              <description>Slot Size</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>SLOTSIZESelect</name>
                <enumeratedValue>
                  <name>8</name>
                  <description>8-bit Slot for Clock Unit n</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16</name>
                  <description>16-bit Slot for Clock Unit n</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>24</name>
                  <description>24-bit Slot for Clock Unit n</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32</name>
                  <description>32-bit Slot for Clock Unit n</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NBSLOTS</name>
              <description>Number of Slots in Frame</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>FSWIDTH</name>
              <description>Frame Sync Width</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>FSWIDTHSelect</name>
                <enumeratedValue>
                  <name>SLOT</name>
                  <description>Frame Sync Pulse is 1 Slot wide (default for I2S protocol)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HALF</name>
                  <description>Frame Sync Pulse is half a Frame wide</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BIT</name>
                  <description>Frame Sync Pulse is 1 Bit wide</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BURST</name>
                  <description>Clock Unit n operates in Burst mode, with a 1-bit wide Frame Sync pulse per Data sample, only when Data transfer is requested</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BITDELAY</name>
              <description>Data Delay from Frame Sync</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>BITDELAYSelect</name>
                <enumeratedValue>
                  <name>LJ</name>
                  <description>Left Justified (0 Bit Delay)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S</name>
                  <description>I2S (1 Bit Delay)</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSSEL</name>
              <description>Frame Sync Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>FSSELSelect</name>
                <enumeratedValue>
                  <name>SCKDIV</name>
                  <description>Divided Serial Clock n is used as Frame Sync n source</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FSPIN</name>
                  <description>FSn input pin is used as Frame Sync n source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FSINV</name>
              <description>Frame Sync Invert</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FSOUTINV</name>
              <description>Frame Sync Output Invert</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SCKSEL</name>
              <description>Serial Clock Select</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SCKSELSelect</name>
                <enumeratedValue>
                  <name>MCKDIV</name>
                  <description>Divided Master Clock n is used as Serial Clock n source</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCKPIN</name>
                  <description>SCKn input pin is used as Serial Clock n source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCKOUTINV</name>
              <description>Serial Clock Output Invert</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKSEL</name>
              <description>Master Clock Select</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>MCKSELSelect</name>
                <enumeratedValue>
                  <name>GCLK</name>
                  <description>GCLK_I2S_n is used as Master Clock n source</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCKPIN</name>
                  <description>MCKn input pin is used as Master Clock n source</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MCKEN</name>
              <description>Master Clock Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKOUTINV</name>
              <description>Master Clock Output Invert</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MCKDIV</name>
              <description>Master Clock Division Factor</description>
              <bitOffset>16</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>MCKOUTDIV</name>
              <description>Master Clock Output Division Factor</description>
              <bitOffset>24</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENCLR</name>
          <description>Interrupt Enable Clear</description>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>RXRDY0</name>
              <description>Receive Ready 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXRDY1</name>
              <description>Receive Ready 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOR0</name>
              <description>Receive Overrun 0 Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOR1</name>
              <description>Receive Overrun 1 Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRDY0</name>
              <description>Transmit Ready 0 Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRDY1</name>
              <description>Transmit Ready 1 Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUR0</name>
              <description>Transmit Underrun 0 Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUR1</name>
              <description>Transmit Underrun 1 Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTENSET</name>
          <description>Interrupt Enable Set</description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>RXRDY0</name>
              <description>Receive Ready 0 Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXRDY1</name>
              <description>Receive Ready 1 Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOR0</name>
              <description>Receive Overrun 0 Interrupt Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOR1</name>
              <description>Receive Overrun 1 Interrupt Enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRDY0</name>
              <description>Transmit Ready 0 Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRDY1</name>
              <description>Transmit Ready 1 Interrupt Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUR0</name>
              <description>Transmit Underrun 0 Interrupt Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUR1</name>
              <description>Transmit Underrun 1 Interrupt Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>INTFLAG</name>
          <description>Interrupt Flag Status and Clear</description>
          <addressOffset>0x14</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>RXRDY0</name>
              <description>Receive Ready 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXRDY1</name>
              <description>Receive Ready 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOR0</name>
              <description>Receive Overrun 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXOR1</name>
              <description>Receive Overrun 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRDY0</name>
              <description>Transmit Ready 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXRDY1</name>
              <description>Transmit Ready 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUR0</name>
              <description>Transmit Underrun 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXUR1</name>
              <description>Transmit Underrun 1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SYNCBUSY</name>
          <description>Synchronization Status</description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>SWRST</name>
              <description>Software Reset Synchronization Status</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ENABLE</name>
              <description>Enable Synchronization Status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN0</name>
              <description>Clock Unit 0 Enable Synchronization Status</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CKEN1</name>
              <description>Clock Unit 1 Enable Synchronization Status</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXEN</name>
              <description>Tx Serializer Enable Synchronization Status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXEN</name>
              <description>Rx Serializer Enable Synchronization Status</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TXDATA</name>
              <description>Tx Data Synchronization Status</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RXDATA</name>
              <description>Rx Data Synchronization Status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
