cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51J.svd
        <register>
          <name>CA1R</name>
          <description>Capabilities 1</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000070</resetValue>
          <fields>
            <field>
              <name>SDR50SUP</name>
              <description>SDR50 Support</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SDR50SUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>SDR50 is Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>SDR50 is Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDR104SUP</name>
              <description>SDR104 Support</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>SDR104SUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>SDR104 is Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>SDR104 is Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DDR50SUP</name>
              <description>DDR50 Support</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DDR50SUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>DDR50 is Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>DDR50 is Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVASUP</name>
              <description>Driver Type A Support</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DRVASUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Driver Type A is Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Driver Type A is Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVCSUP</name>
              <description>Driver Type C Support</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DRVCSUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Driver Type C is Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Driver Type C is Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DRVDSUP</name>
              <description>Driver Type D Support</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>DRVDSUPSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Driver Type D is Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Driver Type D is Supported</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TCNTRT</name>
              <description>Timer Count for Re-Tuning</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>TCNTRTSelect</name>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Re-Tuning Timer disabled</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1S</name>
                  <description>1 second</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2S</name>
                  <description>2 seconds</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4S</name>
                  <description>4 seconds</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8S</name>
                  <description>8 seconds</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>16S</name>
                  <description>16 seconds</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>32S</name>
                  <description>32 seconds</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>64S</name>
                  <description>64 seconds</description>
                  <value>0x7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>128S</name>
                  <description>128 seconds</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>256S</name>
                  <description>256 seconds</description>
                  <value>0x9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>512S</name>
                  <description>512 seconds</description>
                  <value>0xa</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1024S</name>
                  <description>1024 seconds</description>
                  <value>0xb</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OTHER</name>
                  <description>Get information from other source</description>
                  <value>0xf</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TSDR50</name>
              <description>Use Tuning for SDR50</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TSDR50Select</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>SDR50 does not require tuning</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>SDR50 requires tuning</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CLKMULT</name>
              <description>Clock Multiplier</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>CLKMULTSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>Clock Multiplier is Not Supported</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>MCCAR</name>
          <description>Maximum Current Capabilities</description>
          <addressOffset>0x048</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>MAXCUR33V</name>
              <description>Maximum Current for 3.3V</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>MAXCUR33VSelect</name>
                <enumeratedValue>
                  <name>OTHER</name>
                  <description>Get information via another method</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MA</name>
                  <description>4mA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8MA</name>
                  <description>8mA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12MA</name>
                  <description>12mA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXCUR30V</name>
              <description>Maximum Current for 3.0V</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>MAXCUR30VSelect</name>
                <enumeratedValue>
                  <name>OTHER</name>
                  <description>Get information via another method</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MA</name>
                  <description>4mA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8MA</name>
                  <description>8mA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12MA</name>
                  <description>12mA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MAXCUR18V</name>
              <description>Maximum Current for 1.8V</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <enumeratedValues>
                <name>MAXCUR18VSelect</name>
                <enumeratedValue>
                  <name>OTHER</name>
                  <description>Get information via another method</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4MA</name>
                  <description>4mA</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8MA</name>
                  <description>8mA</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12MA</name>
                  <description>12mA</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FERACES</name>
          <description>Force Event for Auto CMD Error Status</description>
          <addressOffset>0x050</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>ACMD12NE</name>
              <description>Force Event for Auto CMD12 Not Executed</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ACMD12NESelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDTEO</name>
              <description>Force Event for Auto CMD Timeout Error</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ACMDTEOSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDCRC</name>
              <description>Force Event for Auto CMD CRC Error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ACMDCRCSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDEND</name>
              <description>Force Event for Auto CMD End Bit Error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ACMDENDSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ACMDIDX</name>
              <description>Force Event for Auto CMD Index Error</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ACMDIDXSelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CMDNI</name>
              <description>Force Event for Command Not Issued By Auto CMD12 Error</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>CMDNISelect</name>
                <enumeratedValue>
                  <name>NO</name>
                  <description>No Interrupt</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>YES</name>
                  <description>Interrupt is generated</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
