cmsis-svd/cmsis-svd/data/Microchip/ATSAMD51J.svd
        <register>
          <name>WAVE</name>
          <description>Waveform Control</description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>WAVEGEN</name>
              <description>Waveform Generation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>WAVEGENSelect</name>
                <enumeratedValue>
                  <name>NFRQ</name>
                  <description>Normal frequency</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MFRQ</name>
                  <description>Match frequency</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NPWM</name>
                  <description>Normal PWM</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSCRITICAL</name>
                  <description>Dual-slope critical</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSBOTTOM</name>
                  <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSBOTH</name>
                  <description>Dual-slope with interrupt/event condition when COUNT reaches ZERO or TOP</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DSTOP</name>
                  <description>Dual-slope with interrupt/event condition when COUNT reaches TOP</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RAMP</name>
              <description>Ramp Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>RAMPSelect</name>
                <enumeratedValue>
                  <name>RAMP1</name>
                  <description>RAMP1 operation</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP2A</name>
                  <description>Alternative RAMP2 operation</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP2</name>
                  <description>RAMP2 operation</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RAMP2C</name>
                  <description>Critical RAMP2 operation</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CIPEREN</name>
              <description>Circular period Enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCEN0</name>
              <description>Circular Channel 0 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCEN1</name>
              <description>Circular Channel 1 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCEN2</name>
              <description>Circular Channel 2 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CICCEN3</name>
              <description>Circular Channel 3 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL0</name>
              <description>Channel 0 Polarity</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL1</name>
              <description>Channel 1 Polarity</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL2</name>
              <description>Channel 2 Polarity</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL3</name>
              <description>Channel 3 Polarity</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL4</name>
              <description>Channel 4 Polarity</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>POL5</name>
              <description>Channel 5 Polarity</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP0</name>
              <description>Swap DTI Output Pair 0</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP1</name>
              <description>Swap DTI Output Pair 1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP2</name>
              <description>Swap DTI Output Pair 2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SWAP3</name>
              <description>Swap DTI Output Pair 3</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER</name>
          <description>Period</description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER_DITH4</name>
          <description>Period</description>
          <alternateRegister>PER</alternateRegister>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER_DITH5</name>
          <description>Period</description>
          <alternateRegister>PER</alternateRegister>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PER_DITH6</name>
          <description>Period</description>
          <alternateRegister>PER</alternateRegister>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PER</name>
              <description>Period Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s</name>
          <description>Compare and Capture</description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s_DITH4</name>
          <description>Compare and Capture</description>
          <alternateRegister>CC%s</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s_DITH5</name>
          <description>Compare and Capture</description>
          <alternateRegister>CC%s</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CC%s_DITH6</name>
          <description>Compare and Capture</description>
          <alternateRegister>CC%s</alternateRegister>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHER</name>
              <description>Dithering Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CC</name>
              <description>Channel Compare/Capture Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PATTBUF</name>
          <description>Pattern Buffer</description>
          <addressOffset>0x64</addressOffset>
          <size>16</size>
          <fields>
            <field>
              <name>PGEB0</name>
              <description>Pattern Generator 0 Output Enable Buffer</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB1</name>
              <description>Pattern Generator 1 Output Enable Buffer</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB2</name>
              <description>Pattern Generator 2 Output Enable Buffer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB3</name>
              <description>Pattern Generator 3 Output Enable Buffer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB4</name>
              <description>Pattern Generator 4 Output Enable Buffer</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB5</name>
              <description>Pattern Generator 5 Output Enable Buffer</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB6</name>
              <description>Pattern Generator 6 Output Enable Buffer</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGEB7</name>
              <description>Pattern Generator 7 Output Enable Buffer</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB0</name>
              <description>Pattern Generator 0 Output Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB1</name>
              <description>Pattern Generator 1 Output Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB2</name>
              <description>Pattern Generator 2 Output Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB3</name>
              <description>Pattern Generator 3 Output Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB4</name>
              <description>Pattern Generator 4 Output Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB5</name>
              <description>Pattern Generator 5 Output Enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB6</name>
              <description>Pattern Generator 6 Output Enable</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PGVB7</name>
              <description>Pattern Generator 7 Output Enable</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUF</name>
          <description>Period Buffer</description>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>PERBUF</name>
              <description>Period Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUF_DITH4</name>
          <description>Period Buffer</description>
          <alternateRegister>PERBUF</alternateRegister>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>PERBUF</name>
              <description>Period Buffer Value</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUF_DITH5</name>
          <description>Period Buffer</description>
          <alternateRegister>PERBUF</alternateRegister>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>PERBUF</name>
              <description>Period Buffer Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PERBUF_DITH6</name>
          <description>Period Buffer</description>
          <alternateRegister>PERBUF</alternateRegister>
          <addressOffset>0x6C</addressOffset>
          <size>32</size>
          <resetValue>0xFFFFFFFF</resetValue>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>PERBUF</name>
              <description>Period Buffer Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCBUF%s</name>
          <description>Compare and Capture Buffer</description>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CCBUF</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>24</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCBUF%s_DITH4</name>
          <description>Compare and Capture Buffer</description>
          <alternateRegister>CCBUF%s</alternateRegister>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>CCBUF</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>4</bitOffset>
              <bitWidth>20</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCBUF%s_DITH5</name>
          <description>Compare and Capture Buffer</description>
          <alternateRegister>CCBUF%s</alternateRegister>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>CCBUF</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>5</bitOffset>
              <bitWidth>19</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <dim>6</dim>
          <dimIncrement>0x4</dimIncrement>
          <name>CCBUF%s_DITH6</name>
          <description>Compare and Capture Buffer</description>
          <alternateRegister>CCBUF%s</alternateRegister>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <fields>
            <field>
              <name>DITHERBUF</name>
              <description>Dithering Buffer Cycle Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
            </field>
            <field>
              <name>CCBUF</name>
              <description>Channel Compare/Capture Buffer Value</description>
              <bitOffset>6</bitOffset>
              <bitWidth>18</bitWidth>
            </field>
          </fields>
        </register>
